In [3]:
import pandas as pd
import numpy as np
from pandas import DataFrame

In [4]:
number_df = DataFrame(np.arange(0,90,3).reshape(10,3), index = ['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6', 'row 7', 'row 8', 'row 9', 'row 10'], columns = ['col 1', 'col 2', 'col 3'])

number_df

        col 1  col 2  col 3
row 1       0      3      6
row 2       9     12     15
row 3      18     21     24
row 4      27     30     33
row 5      36     39     42
row 6      45     48     51
row 7      54     57     60
row 8      63     66     69
row 9      72     75     78
row 10     81     84     87

In [5]:
number_df.iloc[0,1]

np.int64(3)

In [6]:
number_df.iloc[0,1] = 20
number_df

        col 1  col 2  col 3
row 1       0     20      6
row 2       9     12     15
row 3      18     21     24
row 4      27     30     33
row 5      36     39     42
row 6      45     48     51
row 7      54     57     60
row 8      63     66     69
row 9      72     75     78
row 10     81     84     87

In [8]:
number_df.iloc[[1,2,4],[1,2]]

       col 2  col 3
row 2     12     15
row 3     21     24
row 5     39     42

#Comparison operators(>, <, >=, <=, ==, !=)

In [ ]:
mask = number_df > 30 # create a boolean 
mask

        col 1  col 2  col 3
row 1   False  False  False
row 2   False  False  False
row 3   False  False  False
row 4   False  False   True
row 5    True   True   True
row 6    True   True   True
row 7    True   True   True
row 8    True   True   True
row 9    True   True   True
row 10   True   True   True

In [10]:
number_df[mask]

        col 1  col 2  col 3
row 1     NaN    NaN    NaN
row 2     NaN    NaN    NaN
row 3     NaN    NaN    NaN
row 4     NaN    NaN   33.0
row 5    36.0   39.0   42.0
row 6    45.0   48.0   51.0
row 7    54.0   57.0   60.0
row 8    63.0   66.0   69.0
row 9    72.0   75.0   78.0
row 10   81.0   84.0   87.0

In [11]:
number_df[number_df>30] = 0
number_df

        col 1  col 2  col 3
row 1       0     20      6
row 2       9     12     15
row 3      18     21     24
row 4      27     30      0
row 5       0      0      0
row 6       0      0      0
row 7       0      0      0
row 8       0      0      0
row 9       0      0      0
row 10      0      0      0

In [12]:
number_df.iloc[0:5, 0:2]

       col 1  col 2
row 1      0     20
row 2      9     12
row 3     18     21
row 4     27     30
row 5      0      0

Filling missing values using fillna(), replace() and interpolate()

In [7]:
data = {'Name': ['Tom', 'Jerry', 'Mickey', 'Donald', 'Minnie', 'Daisy', 'Pluto', 'Goofy', 'Huey', 'Dewey'],
        'Age': [28, 22, 35, 30, 25, 32, 40, 38, 20, 24],
        'rank': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]}

ranking_df = pd.DataFrame(data)
ranking_df.iloc[0:4, 0:2]
ranking_df.loc[ranking_df['Age'] > 30, ['Name', 'Age']]

     Name  Age
2  Mickey   35
5   Daisy   32
6   Pluto   40
7   Goofy   38

In [6]:
ranking_df.isnull()

    Name    Age   rank
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [8]:
ranking_df.notnull()

   Name   Age  rank
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True
4  True  True  True
5  True  True  True
6  True  True  True
7  True  True  True
8  True  True  True
9  True  True  True

In [11]:
bool_series = pd.isnull(ranking_df["Age"])
ranking_df[bool_series]

Empty DataFrame
Columns: [Name, Age, rank]
Index: []

In [12]:
ranking_df.fillna(0)

     Name  Age  rank
0     Tom   28     1
1   Jerry   22     2
2  Mickey   35     3
3  Donald   30     4
4  Minnie   25     5
5   Daisy   32     6
6   Pluto   40     7
7   Goofy   38     8
8    Huey   20     9
9   Dewey   24    10

In [14]:
ranking_df.dropna(how ='all')

     Name  Age  rank
0     Tom   28     1
1   Jerry   22     2
2  Mickey   35     3
3  Donald   30     4
4  Minnie   25     5
5   Daisy   32     6
6   Pluto   40     7
7   Goofy   38     8
8    Huey   20     9
9   Dewey   24    10